In [4]:
#1 Create Data Frame
import pandas as pd

data = ({
            'Applee':[30],
            'Bananas':[21]
})

df = pd.DataFrame(data)
df

   Applee  Bananas
0      30       21

In [7]:
#2
data = ({
            'Applee':[35,21],
            'Bananas':[41,34]
})

df = pd.DataFrame(data,index=['2017 Sales','2018 Sales'])
df

            Applee  Bananas
2017 Sales      35       41
2018 Sales      21       34

In [8]:
#3.**Exercise 3**: Create a `Series` that looks like this

series = pd.Series(data=['4 cups','1 cup','2 large','1 can'], index=['Flour','Milk','Eggs','Spam'])

series

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
dtype: object

In [9]:
url = 'https://raw.githubusercontent.com/davestroud/Wine/master/winemag-data_first150k.csv'
df = pd.read_csv(url)
df.head(4)

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,variety,winery
0,0,US,This tremendous 100% varietal wine hails from ...,Martha's Vineyard,96,235.0,California,Napa Valley,Napa,Cabernet Sauvignon,Heitz
1,1,Spain,"Ripe aromas of fig, blackberry and cassis are ...",Carodorum Selección Especial Reserva,96,110.0,Northern Spain,Toro,NaN,Tinta de Toro,Bodega Carmen Rodríguez
2,2,US,Mac Watson honors the memory of a wine once ma...,Special Selected Late Harvest,96,90.0,California,Knights Valley,Sonoma,Sauvignon Blanc,Macauley
3,3,US,"This spent 20 months in 30% new French oak, an...",Reserve,96,65.0,Oregon,Willamette Valley,Willamette Valley,Pinot Noir,Ponzi

In [10]:
#Exercise 6: Suppose we have the following DataFrame:
#Save this DataFrame to disc as a csv file with the name cows_and_goats.csv.
q6_df = pd.DataFrame({'Cows': [12, 20], 'Goats': [22, 19]}, index=['Year 1', 'Year 2'])
q6_df.to_csv('cows_and_goats.csv') # its save this file into current directory

In [13]:
# Check Pandas version

print(pd.__version__)

0.24.2

In [14]:
# Create Series from list
series = pd.Series([1,2,4,5])
series

0    1
1    2
2    4
3    5
dtype: int64

In [16]:
#Create Series from ndarray
import numpy as np

rand_arr = np.random.randn(5)
index=['a','b','c','d','e']
series = pd.Series(rand_arr,index)
series

a    0.662357
b   -0.631619
c    0.804689
d    1.244600
e   -0.135055
dtype: float64

In [17]:
#Create Series from dictionary
d = {'a':1,'b':2,'c':3,'d':4}
series = pd.Series(d)
series

a    1
b    2
c    3
d    4
dtype: int64

In [21]:
#Modify Series index
arr=[0, 1, 2, 3, 4]
s1=pd.Series(arr) 
print(s1)
s1.index=['A','B','C','D','E']
print(s1)

0    0
1    1
2    2
3    3
4    4
dtype: int64
A    0
B    1
C    2
D    3
E    4
dtype: int64

In [22]:
#Vertical stitching of Series
d={'a':1,'b':2,'c':3,'d':4,'e':5}
s3=pd.Series(d)
s4 = s3.append(s1)
s4

a    1
b    2
c    3
d    4
e    5
A    0
B    1
C    2
D    3
E    4
dtype: int64

In [25]:
#Series: Delete element at the specified index
print(s4)
s4 = s4.drop(['a','c'])
s4

a    1
b    2
c    3
d    4
e    5
A    0
B    1
C    2
D    3
E    4
dtype: int64

b    2
d    4
e    5
A    0
B    1
C    2
D    3
E    4
dtype: int64

In [26]:
# Series: Modify element at the specified index
s4

b    2
d    4
e    5
A    0
B    1
C    2
D    3
E    4
dtype: int64

In [27]:
#soloution
s4['A']=1234
s4

b       2
d       4
e       5
A    1234
B       1
C       2
D       3
E       4
dtype: int64

In [28]:
#Series: Retrieve the element at the specified index
s4['B']

1

In [30]:
#Series slicing
#Access the first three data of s4:
s4[:3]

b    2
d    4
e    5
dtype: int64

In [32]:
#Series Addition
#Series addition is calculated according to the index, and 
#it would be filled with NaN (null value) if the indexes are different:
print(s4)
print(s3)
print(s4.add(s3))

b       2
d       4
e       5
A    1234
B       1
C       2
D       3
E       4
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64
A     NaN
B     NaN
C     NaN
D     NaN
E     NaN
a     NaN
b     4.0
c     NaN
d     8.0
e    10.0
dtype: float64

In [33]:
print(s4.sub(s3))

A    NaN
B    NaN
C    NaN
D    NaN
E    NaN
a    NaN
b    0.0
c    NaN
d    0.0
e    0.0
dtype: float64

In [35]:
print(s4.mul(s3))

A     NaN
B     NaN
C     NaN
D     NaN
E     NaN
a     NaN
b     4.0
c     NaN
d    16.0
e    25.0
dtype: float64

In [36]:
print(s4.div(s3))

A    NaN
B    NaN
C    NaN
D    NaN
E    NaN
a    NaN
b    1.0
c    NaN
d    1.0
e    1.0
dtype: float64

In [38]:
#Series: Get the median
print(s4)
print()
print(s4.median())

b       2
d       4
e       5
A    1234
B       1
C       2
D       3
E       4
dtype: int64

3.5

In [39]:
#Get the sum
print(s4.sum())

1255

In [40]:
#Get the maximum value
print(s4.max())

1234

In [41]:
#Series: Get the minimum value
print(s4.min())

1

Create Data Frame

In [42]:
num_arr=np.random.randn(6,4) # Import numpy random array
index_dates=pd.date_range('today',periods=6) # Define time sequence as index
columns=['A','B','C','D'] # Use the table as the column name
df1=pd.DataFrame(num_arr,index=index_dates,columns=columns)
df1

                                   A         B         C         D
2019-10-15 15:24:58.472346 -1.371519  3.225364  0.034297  0.288614
2019-10-16 15:24:58.472346  0.024847 -0.154034  0.495498  0.615349
2019-10-17 15:24:58.472346  1.279357 -1.371547 -0.020842  0.375928
2019-10-18 15:24:58.472346  1.005551  0.070176 -0.286299 -0.860601
2019-10-19 15:24:58.472346 -0.708050 -0.418044 -0.127222 -0.265399
2019-10-20 15:24:58.472346  0.990785  0.154791  0.936101 -1.739267

In [43]:
# Create Dataframe with dictionary
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data,labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [44]:
df = pd.DataFrame(data,index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [45]:
#See the data type of DataFrame
df.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

Basic Operations on DataFrame

In [47]:
 #Preview the first five rows of DataFrame data
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

In [48]:
#See the last 3 rows of DataFrame data
df.tail(3)

  animal  age  visits priority
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [50]:
#See the values of DataFrame
df.values

array([['cat', 2.5, 1, 'yes'],
       ['cat', 3.0, 3, 'yes'],
       ['snake', 0.5, 2, 'no'],
       ['dog', nan, 3, 'yes'],
       ['dog', 5.0, 2, 'no'],
       ['cat', 2.0, 3, 'no'],
       ['snake', 4.5, 1, 'no'],
       ['cat', nan, 1, 'yes'],
       ['dog', 7.0, 2, 'no'],
       ['dog', 3.0, 1, 'no']], dtype=object)

In [51]:
#See the column name of DataFrame
df.columns

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [52]:
#See the statistical data of DataFrame
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [53]:
#DataFrame transpose operation
df.T

            a    b      c    d    e    f      g    h    i    j
animal    cat  cat  snake  dog  dog  cat  snake  cat  dog  dog
age       2.5    3    0.5  NaN    5    2    4.5  NaN    7    3
visits      1    3      2    3    2    3      1    1    2    1
priority  yes  yes     no  yes   no   no     no  yes   no   no

In [56]:
#Sort DataFrame by column
df.sort_values(by='age')

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [59]:
#Slice the DataFrame data
print(df)
df[1:4]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes

In [60]:
#Query the DataFrame by tag (single column)
df['age']

a    2.5
b    3.0
c    0.5
d    NaN
e    5.0
f    2.0
g    4.5
h    NaN
i    7.0
j    3.0
Name: age, dtype: float64

In [62]:
df.age

a    2.5
b    3.0
c    0.5
d    NaN
e    5.0
f    2.0
g    4.5
h    NaN
i    7.0
j    3.0
Name: age, dtype: float64

In [65]:
#Query the DataFrame by tag (multiple columns)
print(df[['animal','age']])

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [66]:
#Query the DataFrame by location
df.iloc[1:3]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [68]:
#Generate a Copy of DataFrame
#Generate the copy of DataFrame, making it convenient for datasets to be used by multiple different processes
df3=df1.copy()
df3

                                   A         B         C         D
2019-10-15 15:24:58.472346 -1.371519  3.225364  0.034297  0.288614
2019-10-16 15:24:58.472346  0.024847 -0.154034  0.495498  0.615349
2019-10-17 15:24:58.472346  1.279357 -1.371547 -0.020842  0.375928
2019-10-18 15:24:58.472346  1.005551  0.070176 -0.286299 -0.860601
2019-10-19 15:24:58.472346 -0.708050 -0.418044 -0.127222 -0.265399
2019-10-20 15:24:58.472346  0.990785  0.154791  0.936101 -1.739267

In [69]:
#Judge if DataFrame is empty
df3.isnull()

                                A      B      C      D
2019-10-15 15:24:58.472346  False  False  False  False
2019-10-16 15:24:58.472346  False  False  False  False
2019-10-17 15:24:58.472346  False  False  False  False
2019-10-18 15:24:58.472346  False  False  False  False
2019-10-19 15:24:58.472346  False  False  False  False
2019-10-20 15:24:58.472346  False  False  False  False

In [70]:
df3

                                   A         B         C         D
2019-10-15 15:24:58.472346 -1.371519  3.225364  0.034297  0.288614
2019-10-16 15:24:58.472346  0.024847 -0.154034  0.495498  0.615349
2019-10-17 15:24:58.472346  1.279357 -1.371547 -0.020842  0.375928
2019-10-18 15:24:58.472346  1.005551  0.070176 -0.286299 -0.860601
2019-10-19 15:24:58.472346 -0.708050 -0.418044 -0.127222 -0.265399
2019-10-20 15:24:58.472346  0.990785  0.154791  0.936101 -1.739267

In [73]:
#Make changes based on the subscript value of the DataFrame
df3.iat[1,1]=2 # The index number begins from 0, so here it's 1, 1
df3

                                   A         B         C         D
2019-10-15 15:24:58.472346 -1.371519  3.225364  0.034297  0.288614
2019-10-16 15:24:58.472346  2.000000  2.000000  0.495498  0.615349
2019-10-17 15:24:58.472346  1.279357 -1.371547 -0.020842  0.375928
2019-10-18 15:24:58.472346  1.005551  0.070176 -0.286299 -0.860601
2019-10-19 15:24:58.472346 -0.708050 -0.418044 -0.127222 -0.265399
2019-10-20 15:24:58.472346  0.990785  0.154791  0.936101 -1.739267

In [74]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [75]:
#Modify the data according to the label of the DataFrame
df.loc['f','age']=1.25
df

  animal   age  visits priority
a    cat  2.50       1      yes
b    cat  3.00       3      yes
c  snake  0.50       2       no
d    dog   NaN       3      yes
e    dog  5.00       2       no
f    cat  1.25       3       no
g  snake  4.50       1       no
h    cat   NaN       1      yes
i    dog  7.00       2       no
j    dog  3.00       1       no

In [76]:
#DataFrame: Get the average
df.mean()

age       3.34375
visits    1.90000
dtype: float64

In [78]:
#Do a summation operation on any column in the DataFram
df['visits'].sum()

19

String Operations

In [79]:
#Convert a string to lowercase letters
string = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
print(string)
string.str.lower()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [80]:
#Convert a string to uppercase letters
string.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

Operations for DataFrame missing values

In [82]:
df_copy = df.copy()
df_copy

  animal   age  visits priority
a    cat  2.50       1      yes
b    cat  3.00       3      yes
c  snake  0.50       2       no
d    dog   NaN       3      yes
e    dog  5.00       2       no
f    cat  1.25       3       no
g  snake  4.50       1       no
h    cat   NaN       1      yes
i    dog  7.00       2       no
j    dog  3.00       1       no

In [83]:
#Fill in missing values
df_copy.fillna(value = 4)

  animal   age  visits priority
a    cat  2.50       1      yes
b    cat  3.00       3      yes
c  snake  0.50       2       no
d    dog  4.00       3      yes
e    dog  5.00       2       no
f    cat  1.25       3       no
g  snake  4.50       1       no
h    cat  4.00       1      yes
i    dog  7.00       2       no
j    dog  3.00       1       no

In [84]:
#Delete rows with missing values
df_copy

  animal   age  visits priority
a    cat  2.50       1      yes
b    cat  3.00       3      yes
c  snake  0.50       2       no
d    dog   NaN       3      yes
e    dog  5.00       2       no
f    cat  1.25       3       no
g  snake  4.50       1       no
h    cat   NaN       1      yes
i    dog  7.00       2       no
j    dog  3.00       1       no

In [85]:
df_copy.dropna(how='any')

  animal   age  visits priority
a    cat  2.50       1      yes
b    cat  3.00       3      yes
c  snake  0.50       2       no
e    dog  5.00       2       no
f    cat  1.25       3       no
g  snake  4.50       1       no
i    dog  7.00       2       no
j    dog  3.00       1       no

Index of Time Sequence

In [87]:
date_ranges = pd.date_range(start='2019-01-01', end='2019-12-31', freq='D') 
date_ranges

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10',
               ...
               '2019-12-22', '2019-12-23', '2019-12-24', '2019-12-25',
               '2019-12-26', '2019-12-27', '2019-12-28', '2019-12-29',
               '2019-12-30', '2019-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [89]:
#Create a Series indexed by each day in 2018, and the values are random numbers
series = pd.Series(np.random.rand(len(date_ranges)),index = date_ranges)
series

2019-01-01    0.228244
2019-01-02    0.646975
2019-01-03    0.123436
2019-01-04    0.214831
2019-01-05    0.656047
2019-01-06    0.546708
2019-01-07    0.146964
2019-01-08    0.862385
2019-01-09    0.927123
2019-01-10    0.046051
2019-01-11    0.147820
2019-01-12    0.494002
2019-01-13    0.478871
2019-01-14    0.792037
2019-01-15    0.755740
2019-01-16    0.333499
2019-01-17    0.379727
2019-01-18    0.096564
2019-01-19    0.773648
2019-01-20    0.482871
2019-01-21    0.042419
2019-01-22    0.599271
2019-01-23    0.428211
2019-01-24    0.532714
2019-01-25    0.034422
2019-01-26    0.050160
2019-01-27    0.055192
2019-01-28    0.684818
2019-01-29    0.806324
2019-01-30    0.814549
                ...
2019-12-02    0.253068
2019-12-03    0.762015
2019-12-04    0.659621
2019-12-05    0.456107
2019-12-06    0.741099
2019-12-07    0.247076
2019-12-08    0.885062
2019-12-09    0.600288
2019-12-10    0.938718
2019-12-11    0.158208
2019-12-12    0.454050
2019-12-13    0.019699
2019-12-14    0.372276
2019-12-15    0.465187
2019-12-16    0.552985
2019-12-17    0.526407
2019-12-18    0.314357
2019-12-19    0.128758
2019-12-20    0.550153
2019-12-21    0.147136
2019-12-22    0.851778
2019-12-23    0.914565
2019-12-24    0.989168
2019-12-25    0.496293
2019-12-26    0.854941
2019-12-27    0.352221
2019-12-28    0.830583
2019-12-29    0.487309
2019-12-30    0.275300
2019-12-31    0.400571
Freq: D, Length: 365, dtype: float64

In [93]:
# Get the corresponding values for each Wednesday in series
series[series.index.weekday==2]

2019-01-02    0.646975
2019-01-09    0.927123
2019-01-16    0.333499
2019-01-23    0.428211
2019-01-30    0.814549
2019-02-06    0.039818
2019-02-13    0.116790
2019-02-20    0.230237
2019-02-27    0.655007
2019-03-06    0.314426
2019-03-13    0.630557
2019-03-20    0.855899
2019-03-27    0.717321
2019-04-03    0.514403
2019-04-10    0.865455
2019-04-17    0.368228
2019-04-24    0.067001
2019-05-01    0.269982
2019-05-08    0.660623
2019-05-15    0.990195
2019-05-22    0.021229
2019-05-29    0.474735
2019-06-05    0.993712
2019-06-12    0.620025
2019-06-19    0.672864
2019-06-26    0.960369
2019-07-03    0.061529
2019-07-10    0.758797
2019-07-17    0.309526
2019-07-24    0.300266
2019-07-31    0.984993
2019-08-07    0.308044
2019-08-14    0.714905
2019-08-21    0.090548
2019-08-28    0.514741
2019-09-04    0.808056
2019-09-11    0.925225
2019-09-18    0.085616
2019-09-25    0.760859
2019-10-02    0.214092
2019-10-09    0.583026
2019-10-16    0.986653
2019-10-23    0.274404
2019-10-30    0.139554
2019-11-06    0.556998
2019-11-13    0.156403
2019-11-20    0.960134
2019-11-27    0.004732
2019-12-04    0.659621
2019-12-11    0.158208
2019-12-18    0.314357
2019-12-25    0.496293
dtype: float64

In [95]:
# Get the sum of corresponding values for each Wednesday in series
series[series.index.weekday==2].sum()

26.31681751916956

In [96]:
#Get the average value of each month value in series
series.resample('M').mean()

2019-01-31    0.429223
2019-02-28    0.431535
2019-03-31    0.540866
2019-04-30    0.468384
2019-05-31    0.548015
2019-06-30    0.521007
2019-07-31    0.490955
2019-08-31    0.465821
2019-09-30    0.575121
2019-10-31    0.511114
2019-11-30    0.393604
2019-12-31    0.533058
Freq: M, dtype: float64